In [1]:
import mysql.connector
import pandas as pd

In [2]:
conn = mysql.connector.connect(
    host = "database-1.ckw5zu9hecdi.us-east-2.rds.amazonaws.com",
    port = 3306,
    user = "zero",
    password = "zerobase",
    database = "zerobase"
)

In [10]:
df= pd.read_csv("03. best_sandwiches_list_chicago2.csv")
df.head()

   Rank                    Cafe               Menu  Price              Address
0     1             Old Oak Tap                BLT   $10.  2109 W. Chicago Ave
1     2               Au Cheval      Fried Bologna    $9.   800 W. Randolph St
2     3                    Xoco  Woodland Mushroom  $9.50      445 N. Clark St
3     4               Al’s Deli         Roast Beef  $9.40         914 Noyes St
4     5  Publican Quality Meats               PB&L   $10.    825 W. Fulton Mkt

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     50 non-null     int64
 1   Cafe     50 non-null     object
 2   Menu     50 non-null     object
 3   Price    50 non-null     object
 4   Address  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [14]:
sql = "create table sandwich (ranking int, cafe varchar(22), price float, address varchar(22))"
cursor = conn.cursor(buffered=True)
cursor.execute(sql)

In [17]:
cursor.execute("desc sandwich")
result = cursor.fetchall()

for row in result:
    print(row)

('ranking', b'int', 'YES', '', None, '')
('cafe', b'varchar(22)', 'YES', '', None, '')
('price', b'float', 'YES', '', None, '')
('address', b'varchar(22)', 'YES', '', None, '')

In [25]:
sql = "insert into sandwich values(%s, %s, %s, %s, %s)"

for i, row in df.iterrows():
    cursor.execute(sql, tuple(row))
    print(tuple(row))
    conn.commit()

DataError: 1136 (21S01): Column count doesn't match value count at row 1